app/views/user_mailer/course_mailer.html.erb

  <div style="display:none;visible:hidden">
    <%= course = Course.find_by(id: courses_in_cart.course_id)%>
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]