app/views/students/index.html.erb

SELECT "students".* FROM "students"
---
        <% @courses.each do |course| %>
          <% if course.students && course.students.include?(student.id.to_s) %>