app/views/carts/_form.html.erb

SELECT "courses".* FROM "courses"
---
  <%= form.label :discipline %>
  <%= select("course", "discipline", Course.all.collect{ |c| [ c.discipline, c.id] }) %>