app/views/courses_in_carts/index.html.erb

SELECT "courses".* FROM "courses" WHERE "courses"."course_id" = ? LIMIT ?  [["course_id", 2], ["LIMIT", 1]]
---
    <div style="display:none;visible:hidden">
      <%= course = Course.find_by(id: courses_in_cart.course_id)%>