app/views/courses/enrolled.html.erb

            <% if value.include?(current_user.id) %>
              <td>  <%= User.find(key).name %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]