app/controllers/courses_controller.rb

  def enrolled
    @courses = Course.all
---
SELECT "courses".* FROM "courses"

  def teacher_form_update
    # this is a hash where the values are arrays
    key = User.find_by(name: params[:teacher_id]).id
    @course.ts_hash.store(key, []) unless @course.ts_hash.key?(key)
    # @course.ts_hash[params[:teacher_id]] = [] if @course.ts_hash[params[:teacher_id]].nil?
    @course.ts_hash[key].push(current_user.id) unless @course.ts_hash[key].include?(current_user.id)
    @course.save
---
INSERT INTO "courses" ("number", "name", "discipline", "area", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "courses" SET "discipline" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["discipline", "Computer Science"], ["updated_at", "2020-09-05 02:15:03.893495"], ["id", 1]]

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("number", "name", "discipline", "area", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE "courses" SET "discipline" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["discipline", "Computer Science"], ["updated_at", "2020-09-05 02:15:03.893495"], ["id", 1]]