app/controllers/courses_in_carts_controller.rb

  def index
    @courses_in_carts = CoursesInCart.all
---
SELECT "courses_in_carts".* FROM "courses_in_carts"

  def create
    course = Course.find(params[:course_id])
    @courses_in_cart = @cart.add_course(course)
    respond_to do |format|
      if @courses_in_cart.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-09-08 00:31:30.492457"], ["updated_at", "2020-09-08 00:31:30.492457"]]
INSERT INTO "courses_in_carts" ("course_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["course_id", 1], ["cart_id", 1], ["created_at", "2020-09-11 20:53:25.292828"], ["updated_at", "2020-09-11 20:53:25.292828"]]

  def checkout
    courses_in_cart = CoursesInCart.where(cart_id: session[:cart_id])
    @user = User.find(session[:id])
    UserMailer.with(user: @user).course_mailer(courses_in_cart).deliver_now
    courses_in_cart.each do |c|
      @course = Course.find(c.course_id)
      @course = @course.enroll_student(@user.id, @course)
      @course.save
---
SELECT "courses_in_carts".* FROM "courses_in_carts" WHERE "courses_in_carts"."cart_id" = ?  [["cart_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "courses" SET "students" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["students", "---\n- 9\n"], ["updated_at", "2020-09-11 22:01:33.305845"], ["id", 5]]

  def destroy
    @cart = Cart.find(session[:cart_id])
    @courses_in_cart.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "courses_in_carts" WHERE "courses_in_carts"."id" = ?  [["id", 8]]

  def set_courses_in_cart
    @courses_in_cart = CoursesInCart.find(params[:id])
---
SELECT "courses_in_carts".* FROM "courses_in_carts" WHERE "courses_in_carts"."cart_id" = ? AND "courses_in_carts"."course_id" = ? LIMIT ?  [["cart_id", 1], ["course_id", 2], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_cart
    @cart = Cart.find(session[:cart_id])
  rescue ActiveRecord::RecordNotFound
    @cart = Cart.new
    @cart.save
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-09-11 21:53:48.977112"], ["updated_at", "2020-09-11 21:53:48.977112"]]