app/controllers/sessions_controller.rb

SELECT "courses_in_carts".* FROM "courses_in_carts" WHERE "courses_in_carts"."cart_id" = ?  [["cart_id", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "courses_in_carts".* FROM "courses_in_carts" WHERE "courses_in_carts"."cart_id" IS NULL
---
  def destroy
    courses_in_cart = CoursesInCart.where(cart_id: session[:cart_id])
    courses_in_cart.each(&:destroy)