app/controllers/students_controller.rb

SELECT "students".* FROM "students"
SELECT "courses".* FROM "courses"
---
  def index
    @students = Student.all
    @courses = Course.all

INSERT INTO "users" ("name", "email", "phone_num", "addr", "created_at", "updated_at", "major", "credit_card_name", "credit_card_number", "credit_card_expiration_date", "credit_card_3_digit_cvv", "type", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "students" ("major", "created_at", "updated_at", "credit_card_number", "credit_card_expiration_date", "credit_card_3_digit_cvv") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @student = User.new(student_params.merge!(type: "Student"))
    #@cart = Cart.create
    respond_to do |format|
      if @student.save

UPDATE "students" SET "credit_card_number" = ?, "credit_card_expiration_date" = ?, "credit_card_3_digit_cvv" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["credit_card_number", 1], ["credit_card_expiration_date", 2], ["credit_card_3_digit_cvv", 3], ["updated_at", "2020-09-02 16:24:35.254563"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)