app/controllers/teachers_controller.rb

  def create
    @teacher = User.new(teacher_params.merge!(type: "Teacher"))
    respond_to do |format|
      if @teacher.save
---
INSERT INTO "users" ("name", "email", "phone_num", "addr", "created_at", "updated_at", "discipline", "type", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)