app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "phone_num", "addr", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    set_type
    @user = User.new(user_params)
    # @user[:cart_id] = @user[:id]
    #@user.build(cart_id: @user.id)

    respond_to do |format|
      if @user.save